RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/inc/ht32f5xxxx_tm.h
/*********************************************************************************************************//**
 * @file    ht32f5xxxx_tm.h
 * @version $Rev:: 8260         $
 * @date    $Date:: 2024-11-05 #$
 * @brief   The header file of the TM library.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------------------------------------*/
#ifndef __HT32F5XXXX_TM_H
#define __HT32F5XXXX_TM_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"

/** @addtogroup HT32F5xxxx_Peripheral_Driver HT32F5xxxx Peripheral Driver
  * @{
  */

/** @addtogroup TM
  * @{
  */


/* Exported types ------------------------------------------------------------------------------------------*/
/** @defgroup TM_Exported_Types TM exported types
  * @{
  */
/**
 * @brief Enumeration of TM counter mode.
 */
typedef enum
{
  TM_CNT_MODE_UP   = 0x00000000,  /*!< Edge up-counting mode                                                */
  TM_CNT_MODE_CA1  = 0x00010000,  /*!< Center-align mode 1                                                  */
  TM_CNT_MODE_CA2  = 0x00020000,  /*!< Center-align mode 2                                                  */
  TM_CNT_MODE_CA3  = 0x00030000,  /*!< Center-align mode 3                                                  */
  TM_CNT_MODE_DOWN = 0x01000000   /*!< Edge down-counting mode                                              */
} TM_CNT_MODE_Enum;
/**
 * @brief Enumeration of  TM prescaler reload time.
 */
typedef enum
{
  TM_PSC_RLD_UPDATE    = 0x0000,  /*!< Reload prescaler at next update event                                */
  TM_PSC_RLD_IMMEDIATE = 0x0100   /*!< Reload prescaler immediately                                         */
} TM_PSC_RLD_Enum;
/**
 * @brief Enumeration of TM channel output mode.
 */
typedef enum
{
  TM_OM_MATCH_NOCHANGE  = 0x0000, /*!< TM channel output no change on match                                 */
  TM_OM_MATCH_INACTIVE  = 0x0001, /*!< TM channel output inactive level on match                            */
  TM_OM_MATCH_ACTIVE    = 0x0002, /*!< TM channel output active level on match                              */
  TM_OM_MATCH_TOGGLE    = 0x0003, /*!< TM channel output toggle on match                                    */
  TM_OM_FORCED_INACTIVE = 0x0004, /*!< TM channel output forced inactive level                              */
  TM_OM_FORCED_ACTIVE   = 0x0005, /*!< TM channel output forced active level                                */
  TM_OM_PWM1            = 0x0006, /*!< TM channel pwm1 output mode                                          */
  TM_OM_PWM2            = 0x0007, /*!< TM channel pwm2 output mode                                          */
  TM_OM_ASYMMETRIC_PWM1 = 0x0106, /*!< TM channel asymmetric pwm1 output mode                               */
  TM_OM_ASYMMETRIC_PWM2 = 0x0107  /*!< TM channel asymmetric pwm2 output mode                               */
} TM_OM_Enum;
/**
 * @brief Enumeration of TM channel capture source selection.
 */
typedef enum
{
  TM_CHCCS_DIRECT   = 0x00010000,  /*!< TM channel capture selection direct input                           */
  TM_CHCCS_INDIRECT = 0x00020000,  /*!< TM channel capture selection indirect input                         */
  TM_CHCCS_TRCED    = 0x00030000   /*!< TM channel capture selection TRCED of trigger control block         */
} TM_CHCCS_Enum;
/**
 * @brief Enumeration of TM channel capture prescaler.
 */
typedef enum
{
  TM_CHPSC_OFF = 0x00000000,     /*!< TM channel capture no prescaler, capture is done each event           */
  TM_CHPSC_2   = 0x00040000,     /*!< TM channel capture is done once every 2 event                         */
  TM_CHPSC_4   = 0x00080000,     /*!< TM channel capture is done once every 4 event                         */
  TM_CHPSC_8   = 0x000C0000      /*!< TM channel capture is done once every 8 event                         */
} TM_CHPSC_Enum;
#if (LIBCFG_TM_65X_66X_V1)
/**
 * @brief Enumeration of TM channel Filter (Fsampling) Clock Divider.
 */
typedef enum
{
  TM_CHFDIV_1   = 0x00000000,     /*!< TM channel Filter Fsampling = Fdts                                   */
  TM_CHFDIV_2   = 0x00000001,     /*!< TM channel Filter Fsampling = Fdts/2                                 */
  TM_CHFDIV_4   = 0x00000002,     /*!< TM channel Filter Fsampling = Fdts/4                                 */
  TM_CHFDIV_8   = 0x00000003,     /*!< TM channel Filter Fsampling = Fdts/8                                 */
  TM_CHFDIV_16  = 0x00000004,     /*!< TM channel Filter Fsampling = Fdts/16                                */
  TM_CHFDIV_32  = 0x00000005,     /*!< TM channel Filter Fsampling = Fdts/32                                */
  TM_CHFDIV_64  = 0x00000006      /*!< TM channel Filter Fsampling = Fdts/64                                */
} TM_CHFDIV_Enum;
/**
 * @brief Enumeration of TM channel Filter N-event counter
 */
#if (LIBCFG_TM_TIFN_5BIT)
typedef enum
{
  TM_CHFEV_OFF = 0,               /*!< TM channel Filter off                                                */
  TM_CHFEV_1,                     /*!< TM channel Filter n event counter Setting                            */
  TM_CHFEV_2,
  TM_CHFEV_3,
  TM_CHFEV_4,
  TM_CHFEV_5,
  TM_CHFEV_6,
  TM_CHFEV_7,
  TM_CHFEV_8,
  TM_CHFEV_9,
  TM_CHFEV_10,
  TM_CHFEV_11,
  TM_CHFEV_12,
  TM_CHFEV_13,
  TM_CHFEV_14,
  TM_CHFEV_15,
  TM_CHFEV_16,
  TM_CHFEV_17,
  TM_CHFEV_18,
  TM_CHFEV_19,
  TM_CHFEV_20,
  TM_CHFEV_21,
  TM_CHFEV_22,
  TM_CHFEV_23,
  TM_CHFEV_24,
  TM_CHFEV_25,
  TM_CHFEV_26,
  TM_CHFEV_27,
  TM_CHFEV_28,
  TM_CHFEV_29,
  TM_CHFEV_30,
  TM_CHFEV_31,
} TM_CHFEV_Enum;
#else
typedef enum
{
  TM_CHFEV_OFF = 0x00000000,     /*!< TM channel Filter off                                                 */
  TM_CHFEV_2   = 0x00000001,     /*!< TM channel Filter 2 event counter Setting                             */
  TM_CHFEV_4   = 0x00000002,     /*!< TM channel Filter 4 event counter Setting                             */
  TM_CHFEV_8   = 0x00000003,     /*!< TM channel Filter 8 event counter Setting                             */
  TM_CHFEV_12  = 0x00000004,     /*!< TM channel Filter 12 event counter Setting                            */
  TM_CHFEV_16  = 0x00000005      /*!< TM channel Filter 16 event counter Setting                            */
} TM_CHFEV_Enum;
#endif
#endif
/**
 * @brief Enumeration of TM fDTS clock divider.
 */
typedef enum
{
  TM_CKDIV_OFF = 0x0000,          /*!< fDTS = fCLKIN                                                        */
  TM_CKDIV_2   = 0x0100,          /*!< fDTS = fCLKIN / 2                                                    */
  TM_CKDIV_4   = 0x0200,          /*!< fDTS = fCLKIN / 4                                                    */
  #if (LIBCFG_TM_65X_66X_V1 || LIBCFG_TM_CKDIV_8)
  TM_CKDIV_8   = 0x0300,          /*!< fDTS = fCLKIN / 8                                                    */
  #endif
} TM_CKDIV_Enum;
