RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/inc/ht32f5xxxx_tm.h
#if 0
/**
 * @brief Enumeration of TM ETI input prescaler.
 */
typedef enum
{
  TM_ETIPSC_OFF = 0x00000000,     /*!< ETI prescaler off                                                    */
  TM_ETIPSC_2   = 0x00001000,     /*!< ETIP frequency divided by 2                                          */
  TM_ETIPSC_4   = 0x00002000,     /*!< ETIP frequency divided by 4                                          */
  TM_ETIPSC_8   = 0x00003000      /*!< ETIP frequency divided by 8                                          */
} TM_ETIPSC_Enum;
/**
 * @brief Enumeration of TM ETI input polarity.
 */
typedef enum
{
  TM_ETIPOL_NONINVERTED = 0x00000000, /*!< TM ETI polarity is active high or rising edge                    */
  TM_ETIPOL_INVERTED    = 0x00010000  /*!< TM ETI polarity is active low or falling edge                    */
} TM_ETIPOL_Enum;
#endif
/**
 * @brief Enumeration of TM slave trigger input selection.
 */
typedef enum
{
  TM_TRSEL_UEVG   = 0x0,         /*!< Software trigger by setting UEVG bit                                  */
  TM_TRSEL_TI0S0  = 0x1,         /*!< Filtered channel 0 input                                              */
  TM_TRSEL_TI1S1  = 0x2,         /*!< Filtered channel 1 input                                              */
  TM_TRSEL_ETIF   = 0x3,         /*!< External Trigger input                                                */
  TM_TRSEL_TI0BED = 0x8,         /*!< Trigger input 0 both edge detector                                    */
#if (LIBCFG_TM_NO_ITI == 1)
  #define IS_TRSEL_ITI0(x)   (0)
  #define IS_TRSEL_ITI1(x)   (0)
  #define IS_TRSEL_ITI2(x)   (0)
#else
  TM_TRSEL_ITI0   = 0x9,         /*!< Internal trigger input 0                                              */
  TM_TRSEL_ITI1   = 0xA,         /*!< Internal trigger input 1                                              */
  TM_TRSEL_ITI2   = 0xB          /*!< Internal trigger input 2                                              */
  #define IS_TRSEL_ITI0(x)   (x == TM_TRSEL_ITI0)
  #define IS_TRSEL_ITI1(x)   (x == TM_TRSEL_ITI1)
  #define IS_TRSEL_ITI2(x)   (x == TM_TRSEL_ITI2)
#endif
} TM_TRSEL_Enum;
/**
 * @brief Enumeration of TM slave mode selection.
 */
typedef enum
{
  TM_SMSEL_DISABLE  = 0x0000,     /*!< The prescaler is clocked directly by the internal clock              */
  TM_SMSEL_DECODER1 = 0x0100,     /*!< Counter counts up/down on CH0 edge depending on CH1 level            */
  TM_SMSEL_DECODER2 = 0x0200,     /*!< Counter counts up/down on CH1 edge depending on CH0 level            */
  TM_SMSEL_DECODER3 = 0x0300,     /*!< Counter counts up/down on both CH0 & CH1 edges depending on the
                                       level of the other input */
  TM_SMSEL_RESTART  = 0x0400,     /*!< Slave restart mode                                                   */
  TM_SMSEL_PAUSE    = 0x0500,     /*!< Slave pause mode                                                     */
  TM_SMSEL_TRIGGER  = 0x0600,     /*!< Slave trigger mode                                                   */
  TM_SMSEL_STIED    = 0x0700,     /*!< Rising edge of the selected trigger(STI) clock the counter           */
  #if (LIBCFG_TM_65X_66X_V1)
  TM_SMSEL_DECODER4 = 0x0800,     /*!< Pluse/Direction mode(Counter counts on Ch0, Count up/down on Ch1     */
  #endif
} TM_SMSEL_Enum;
/**
 * @brief  Enumeration of TM master mode selection.
 */
typedef enum
{
  TM_MMSEL_RESET   = 0x00000000,  /*!< Send trigger signal when S/W setting UEVG or slave restart           */
  TM_MMSEL_ENABLE  = 0x00010000,  /*!< The counter enable signal is used as trigger output.                 */
  TM_MMSEL_UPDATE  = 0x00020000,  /*!< The update event is used as trigger output.                          */
  TM_MMSEL_CH0CC   = 0x00030000,  /*!< Channel 0 capture or compare match occurred as trigger output.       */
  TM_MMSEL_CH0OREF = 0x00040000,  /*!< The CH0OREF signal is used as trigger output.                        */
  TM_MMSEL_CH1OREF = 0x00050000,  /*!< The CH1OREF signal is used as trigger output.                        */
  TM_MMSEL_CH2OREF = 0x00060000,  /*!< The CH2OREF signal is used as trigger output.                        */
  TM_MMSEL_CH3OREF = 0x00070000,  /*!< The CH3OREF signal is used as trigger output.                        */
  #if (LIBCFG_TM_65X_66X_V1)
  TM_MMSEL_VCLK    = 0x000C0000   /*!< The VCLK signal is used as trigger output.                           */
  #endif
  #if (LIBCFG_PWM_8_CHANNEL)
  TM_MMSEL_CH4OREF = 0x00080000,   /*!< The CH4OREF signal is used as trigger output.                       */
  TM_MMSEL_CH5OREF = 0x00090000,   /*!< The CH5OREF signal is used as trigger output.                       */
  TM_MMSEL_CH6OREF = 0x000A0000,   /*!< The CH6OREF signal is used as trigger output.                       */
  TM_MMSEL_CH7OREF = 0x000B0000    /*!< The CH7OREF signal is used as trigger output.                       */
  #endif
} TM_MMSEL_Enum;
#if (LIBCFG_PDMA)
/**
 * @brief Enumeration of TM channel Capture / Compare PDMA selection.
 */
typedef enum
{
  TM_CHCCDS_CHCCEV = 0,       /*!< Send CHx PDMA request when channel capture/compare event occurs          */
  TM_CHCCDS_UEV               /*!< Send CHx PDMA request when update event occurs                           */
} TM_CHCCDS_Enum;
#endif
/**
 * @brief Definition of TM timebase init structure.
 */
typedef struct
{
  u16              CounterReload;         /*!< Period (Value for CRR register)                              */
#if(LIBCFG_TM_PRESCALER_8BIT)
  u8               Prescaler;             /*!< Prescaler (Value for PSCR register)                          */
#else
  u16              Prescaler;             /*!< Prescaler (Value for PSCR register)                          */
#endif
  u8               RepetitionCounter;     /*!< Repetition counter                                           */
  TM_CNT_MODE_Enum CounterMode;           /*!< Counter mode refer to \ref TM_CNT_MODE_Enum                  */
  TM_PSC_RLD_Enum  PSCReloadTime;         /*!< Prescaler reload mode refer to \ref TM_PSC_RLD_Enum          */
} TM_TimeBaseInitTypeDef;
/**
 * @brief Definition of TM channel output init structure.
 */
typedef struct
{
  TM_CH_Enum      Channel;              /*!< Channel selection refer to \ref TM_CH_Enum                     */
  TM_OM_Enum      OutputMode;           /*!< Channel output mode selection refer to \ref TM_OM_Enum         */
  TM_CHCTL_Enum   Control;              /*!< CHxO output state refer to \ref TM_CHCTL_Enum                  */
  TM_CHCTL_Enum   ControlN;             /*!< CHxO output state refer to \ref TM_CHCTL_Enum                  */
  TM_CHP_Enum     Polarity;             /*!< CHxO polarity refer to \ref TM_CHP_Enum                        */
  TM_CHP_Enum     PolarityN;            /*!< CHxO polarity refer to \ref TM_CHP_Enum                        */
  MCTM_OIS_Enum   IdleState;            /*!< CHxO polarity refer to \ref TM_CHP_Enum                        */
  MCTM_OIS_Enum   IdleStateN;           /*!< CHxO polarity refer to \ref TM_CHP_Enum                        */
  u16             Compare;              /*!< Value for CHxCCR register                                      */
  u16             AsymmetricCompare;    /*!< Value for CHxACR register                                      */
} TM_OutputInitTypeDef;
/**
 * @brief Definition of TM channel input init structure.
 */
typedef struct
{
  TM_CH_Enum    Channel;         /*!< Channel selection refer to \ref TM_CH_Enum                            */
  TM_CHP_Enum   Polarity;        /*!< Channel input polarity refer to \ref TM_CHP_Enum                      */
  TM_CHCCS_Enum Selection;       /*!< Channel capture source selection refer to \ref TM_CHCCS_Enum          */
  TM_CHPSC_Enum Prescaler;       /*!< Channel Capture prescaler refer to \ref TM_CHPSC_Enum                 */
  #if (LIBCFG_TM_65X_66X_V1)
  TM_CHFDIV_Enum  Fsampling;     /*!< Digital filter Fsampling Frequency, it must fDTS/1 ~ fDTS/64          */
  #if (LIBCFG_TM_TIFN_5BIT)
  u8              Event;         /*!< Digital filter N-event counter Setting, it must be 0 ~ 31             */
  #else
  TM_CHFEV_Enum   Event;         /*!< Digital filter N-event counter Setting, it must be 0, 2, 4, 8, 12, 16 */
  #endif
  #else
  u8            Filter;          /*!< Digital filter Configuration, it must between 0x0 ~ 0xF.              */
  #endif
} TM_CaptureInitTypeDef;
/**
  * @}
  */

