RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/inc/ht32f5xxxx_tm.h
/* Exported constants --------------------------------------------------------------------------------------*/
/** @defgroup TM_Exported_Constants TM exported constants
  * @{
  */

/** @defgroup TM_INT Definitions of TM_INT
  * @{
  */
#define TM_INT_CH0CC        0x0001  /*!< Channel 0 capture/compare interrupt                                */
#define TM_INT_CH1CC        0x0002  /*!< Channel 1 capture/compare interrupt                                */
#define TM_INT_CH2CC        0x0004  /*!< Channel 2 capture/compare interrupt                                */
#define TM_INT_CH3CC        0x0008  /*!< Channel 3 capture/compare interrupt                                */
#if (LIBCFG_PWM_8_CHANNEL)
#define TM_INT_CH4CC        0x10000000ul      /*!< Channel 4 compare interrupt                              */
#define TM_INT_CH5CC        0x20000000ul      /*!< Channel 5 compare interrupt                              */
#define TM_INT_CH6CC        0x40000000ul      /*!< Channel 6 compare interrupt                              */
#define TM_INT_CH7CC        0x80000000ul      /*!< Channel 7 compare interrupt                              */
#endif
#define TM_INT_UEV          0x0100  /*!< Update interrupt                                                   */
#define TM_INT_UEV2         0x0200  /*!< Update interrupt 2                                                 */
#define TM_INT_TEV          0x0400  /*!< Trigger interrupt                                                  */
#define TM_INT_BRKEV        0x0800  /*!< Break interrupt                                                    */

#if (LIBCFG_TM_65X_66X_V1)
#define MCTM_INT_CH0CD      0x100000  /*!< Channel 0 Count-Down compare interrupt                           */
#define MCTM_INT_CH1CD      0x200000  /*!< Channel 1 Count-Down compare interrupt                           */
#define MCTM_INT_CH2CD      0x400000  /*!< Channel 2 Count-Down compare interrupt                           */
#define MCTM_INT_CH3CD      0x800000  /*!< Channel 3 Count-Down compare interrupt                           */

#define TM_INT_VC           0x1000  /*!< Quadrature Decoder VCLK interrupt                                  */
#define TM_INT_QC           0x2000  /*!< Quadrature Decoder CLKPULSE interrupt                              */
#define TM_INT_PE           0x4000  /*!< Quadrature Decoder Phase Error interrupt                           */
#define TM_INT_DC           0x8000  /*!< Quadrature Decoder Direction Change interrupt                      */

#define MCTM_INT_OVER       0x2000  /*!< Counter overflow interrupt                                         */
#define MCTM_INT_UNDER      0x4000  /*!< Counter underflow Interrupt                                        */
#if (LIBCFG_TM_RECCDI)
#define MCTM_INT_RECCDIF    0x8000  /*!< CCIF or CDIF Interrupt flag control by REPR                        */
#endif

#endif
/**
  * @}
  */

#if (LIBCFG_PDMA)
/** @defgroup TM_PDMA Definitions of TM_PDMA
  * @{
  */
#define TM_PDMA_CH0CC        0x00010000  /*!< Channel 0 capture/compare PDMA request                        */
#define TM_PDMA_CH1CC        0x00020000  /*!< Channel 1 capture/compare PDMA request                        */
#define TM_PDMA_CH2CC        0x00040000  /*!< Channel 2 capture/compare PDMA request                        */
#define TM_PDMA_CH3CC        0x00080000  /*!< Channel 3 capture/compare PDMA request                        */
#define TM_PDMA_UEV          0x01000000  /*!< Update PDMA request                                           */
#define TM_PDMA_UEV2         0x02000000  /*!< Update 2 PDMA request                                         */
#define TM_PDMA_TEV          0x04000000  /*!< Trigger PDMA request                                          */
/**
  * @}
  */
#endif

/** @defgroup TM_EVENT Definitions of TM_EVENT
  * @{
  */
#define TM_EVENT_CH0CC      0x0001  /*!< Channel 0 capture/compare event                                    */
#define TM_EVENT_CH1CC      0x0002  /*!< Channel 1 capture/compare event                                    */
#define TM_EVENT_CH2CC      0x0004  /*!< Channel 2 capture/compare event                                    */
#define TM_EVENT_CH3CC      0x0008  /*!< Channel 3 capture/compare event                                    */
#if (LIBCFG_PWM_8_CHANNEL)
#define TM_EVENT_CH4CC      0x10000000ul  /*!< Channel 4 compare event                                      */
#define TM_EVENT_CH5CC      0x20000000ul  /*!< Channel 5 compare event                                      */
#define TM_EVENT_CH6CC      0x40000000ul  /*!< Channel 6 compare event                                      */
#define TM_EVENT_CH7CC      0x80000000ul  /*!< Channel 7 compare event                                      */
#endif
#define TM_EVENT_UEV        0x0100  /*!< Update event                                                       */
#define TM_EVENT_UEV2       0x0200  /*!< Update event 2                                                     */
#define TM_EVENT_TEV        0x0400  /*!< Trigger event                                                      */
#define TM_EVENT_BRKEV      0x0800  /*!< Break event                                                        */
/**
  * @}
  */

/** @defgroup TM_FLAG Definitions of TM_FLAG
  * @{
  */
#define TM_FLAG_CH0CC       0x0001  /*!< Channel 0 capture/compare flag                                     */
#define TM_FLAG_CH1CC       0x0002  /*!< Channel 1 capture/compare flag                                     */
#define TM_FLAG_CH2CC       0x0004  /*!< Channel 2 capture/compare flag                                     */
#define TM_FLAG_CH3CC       0x0008  /*!< Channel 3 capture/compare flag                                     */
#if (LIBCFG_PWM_8_CHANNEL)
#define TM_FLAG_CH4CC       0x10000000ul  /*!< Channel 4 compare flag                                       */
#define TM_FLAG_CH5CC       0x20000000ul  /*!< Channel 5 compare flag                                       */
#define TM_FLAG_CH6CC       0x40000000ul  /*!< Channel 6 compare flag                                       */
#define TM_FLAG_CH7CC       0x80000000ul  /*!< Channel 7 compare flag                                       */
#endif
#define TM_FLAG_CH0OC       0x0010  /*!< Channel 0 over capture flag                                        */
#define TM_FLAG_CH1OC       0x0020  /*!< Channel 1 over capture flag                                        */
#define TM_FLAG_CH2OC       0x0040  /*!< Channel 2 over capture flag                                        */
#define TM_FLAG_CH3OC       0x0080  /*!< Channel 3 over capture flag                                        */
#define TM_FLAG_UEV         0x0100  /*!< Update flag                                                        */
#define TM_FLAG_UEV2        0x0200  /*!< Update 2 flag                                                      */
#define TM_FLAG_TEV         0x0400  /*!< Trigger flag                                                       */
#define TM_FLAG_BRK0        0x0800  /*!< Break 0 flag                                                       */
#define TM_FLAG_BRK1        0x1000  /*!< Break 1 flag                                                       */
/**
  * @}
  */

/** @defgroup TM_Check_Parameter Check parameter
  * @{
  */

/**
 * @brief Used to check parameter of the TMx.
 */
#define IS_TM(x)            (IS_GPTM0(x) || IS_GPTM1(x) || IS_MCTM0(x) || IS_PWM0(x) || IS_PWM1(x) || IS_PWM2(x) || IS_SCTM(x))
#if (!LIBCFG_NO_GPTM0)
#define IS_GPTM0(x)         (x == HT_GPTM0)
#else
#define IS_GPTM0(x)         (0)
#endif

#if (LIBCFG_GPTM1)
#define IS_GPTM1(x)         (x == HT_GPTM1)
#else
#define IS_GPTM1(x)         (0)
#endif

#if (LIBCFG_MCTM0)
#define IS_MCTM0(x)         (x == HT_MCTM0)
#else
#define IS_MCTM0(x)         (0)
#endif

