RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/inc/ht32f5xxxx_tm.h
#if (LIBCFG_PWM0)
#define IS_PWM0(x)          (x == HT_PWM0)
#else
#define IS_PWM0(x)          (0)
#endif

#if (LIBCFG_PWM1)
#define IS_PWM1(x)          (x == HT_PWM1)
#else
#define IS_PWM1(x)          (0)
#endif

#if (LIBCFG_PWM2)
#define IS_PWM2(x)          (x == HT_PWM2)
#else
#define IS_PWM2(x)          (0)
#endif

#define IS_SCTM(x)          (IS_SCTM0(x) || IS_SCTM1(x) || IS_SCTM2(x) || IS_SCTM3(x))

#define IS_SCTM0(x)         (0)
#define IS_SCTM1(x)         (0)
#define IS_SCTM2(x)         (0)
#define IS_SCTM3(x)         (0)

#if (LIBCFG_SCTM0)
#undef IS_SCTM0
#define IS_SCTM0(x)         (x == HT_SCTM0)
#endif

#if (LIBCFG_SCTM1)
#undef IS_SCTM1
#define IS_SCTM1(x)         (x == HT_SCTM1)
#endif

#if (LIBCFG_SCTM2)
#undef IS_SCTM2
#define IS_SCTM2(x)         (x == HT_SCTM2)
#endif

#if (LIBCFG_SCTM3)
#undef IS_SCTM3
#define IS_SCTM3(x)         (x == HT_SCTM3)
#endif

/**
 * @brief Used to check parameter of the output compare mode.
 */
#define IS_TM_OM_CMP(x) (((x) == TM_OM_MATCH_NOCHANGE) || \
                         ((x) == TM_OM_MATCH_INACTIVE) || \
                         ((x) == TM_OM_MATCH_ACTIVE)   || \
                         ((x) == TM_OM_MATCH_TOGGLE)   || \
                         ((x) == TM_OM_PWM1)           || \
                         ((x) == TM_OM_PWM2))
/**
 * @brief Used to check parameter of the output mode.
 */
#define IS_TM_OM(x) (((x) == TM_OM_MATCH_NOCHANGE)  || \
                     ((x) == TM_OM_MATCH_INACTIVE)  || \
                     ((x) == TM_OM_MATCH_ACTIVE)    || \
                     ((x) == TM_OM_MATCH_TOGGLE)    || \
                     ((x) == TM_OM_PWM1)            || \
                     ((x) == TM_OM_PWM2)            || \
                     ((x) == TM_OM_FORCED_INACTIVE) || \
                     ((x) == TM_OM_FORCED_ACTIVE)   || \
                     ((x) == TM_OM_ASYMMETRIC_PWM1) || \
                     ((x) == TM_OM_ASYMMETRIC_PWM2))

#define IS_TM_OM_NOASYM(x) (((x) == TM_OM_MATCH_NOCHANGE)  || \
                            ((x) == TM_OM_MATCH_INACTIVE)  || \
                            ((x) == TM_OM_MATCH_ACTIVE)    || \
                            ((x) == TM_OM_MATCH_TOGGLE)    || \
                            ((x) == TM_OM_PWM1)            || \
                            ((x) == TM_OM_PWM2)            || \
                            ((x) == TM_OM_FORCED_INACTIVE) || \
                            ((x) == TM_OM_FORCED_ACTIVE))
/**
 * @brief Used to check parameter of the channel.
 */
#define IS_TM_CH_0(x)     (x == TM_CH_0)
#define IS_TM_CH_1(x)     (x == TM_CH_1)
#define IS_TM_CH_2(x)     (x == TM_CH_2)
#define IS_TM_CH_3(x)     (x == TM_CH_3)
#if (LIBCFG_PWM_8_CHANNEL)
#define IS_TM_CH_4(x)     (x == TM_CH_4)
#define IS_TM_CH_5(x)     (x == TM_CH_5)
#define IS_TM_CH_6(x)     (x == TM_CH_6)
#define IS_TM_CH_7(x)     (x == TM_CH_7)
#else
#define IS_TM_CH_4(x)     (0)
#define IS_TM_CH_5(x)     (0)
#define IS_TM_CH_6(x)     (0)
#define IS_TM_CH_7(x)     (0)
#endif
#define IS_TM_CH(x)  (IS_TM_CH_0(x) || IS_TM_CH_1(x) || \
                      IS_TM_CH_2(x) || IS_TM_CH_3(x) || \
                      IS_TM_CH_4(x) || IS_TM_CH_5(x) || \
                      IS_TM_CH_6(x) || IS_TM_CH_7(x) )

/**
 * @brief Used to check parameter of the channel for PWM input function.
 */
#define IS_TM_CH_PWMI(x) (((x) == TM_CH_0) || ((x) == TM_CH_1))
/**
 * @brief Used to check parameter of the clock divider.
 */
#define IS_TM_CKDIV_OFF(x) (x == TM_CKDIV_OFF)
#define IS_TM_CKDIV_2(x)   (x == TM_CKDIV_2)
#define IS_TM_CKDIV_4(x)   (x == TM_CKDIV_4)

#if (LIBCFG_TM_CKDIV_8)
#define IS_TM_CKDIV_8(x)   (x == TM_CKDIV_8)
#else
#define IS_TM_CKDIV_8(x)   (0)
#endif

#define IS_TM_CKDIV(x)  (IS_TM_CKDIV_OFF(x) || \
                         IS_TM_CKDIV_2(x)   || \
                         IS_TM_CKDIV_4(x)   || \
                         IS_TM_CKDIV_8(x))
/**
 * @brief Used to check parameter of the counter mode.
 */
#define IS_TM_CNT_MODE(x)   ((x == TM_CNT_MODE_UP)  ||  \
                             (x == TM_CNT_MODE_CA1) || \
                             (x == TM_CNT_MODE_CA2) || \
                             (x == TM_CNT_MODE_CA3) || \
                             (x == TM_CNT_MODE_DOWN))
/**
 * @brief Used to check parameter of the channel polarity.
 */
#define IS_TM_CHP(x)    ((x == TM_CHP_NONINVERTED) || (x == TM_CHP_INVERTED))
/**
 * @brief Used to check parameter of the channel control.
 */
#define IS_TM_CHCTL(x)  ((x == TM_CHCTL_DISABLE) || (x == TM_CHCTL_ENABLE))
/**
 * @brief Used to check parameter of the channel capture / compare PDMA selection.
 */
#define IS_TM_CHCCDS(x) ((x == TM_CHCCDS_CHCCEV) || (x == TM_CHCCDS_UEV))
/**
 * @brief Used to check parameter of the channel input selection.
 */
#define IS_TM_CHCCS(x)  ((x == TM_CHCCS_DIRECT)   || \
                         (x == TM_CHCCS_INDIRECT) || \
                         (x == TM_CHCCS_TRCED))
/**
 * @brief Used to check parameter of the channel capture prescaler.
 */
#define IS_TM_CHPSC(x)  ((x == TM_CHPSC_OFF) || \
                         (x == TM_CHPSC_2)   || \
                         (x == TM_CHPSC_4)   || \
                         (x == TM_CHPSC_8))
#if 0
/**
 * @brief Used to check parameter of the ETI prescaler.
 */
#define IS_TM_ETIPSC(x) ((x == TM_ETIPSC_OFF) || \
                         (x == TM_ETIPSC_2)   || \
                         (x == TM_ETIPSC_4)   || \
                         (x == TM_ETIPSC_8))
#endif
/**
 * @brief Used to check parameter of the TM interrupt.
 */
#define IS_TM_INT(x) (((x & 0xFF0F10F0) == 0x0) && (x != 0))
/**
 * @brief Used to check parameter of the TM PDMA request.
 */
#define IS_TM_PDMA(x) (((x & 0xFAF0FFFF) == 0x0) && (x != 0))
/**
 * @brief Used to check parameter of the TM interrupt for \ref TM_GetIntStatus function.
 */
#define IS_TM_INT_CH0CC(x) (x == TM_INT_CH0CC)
#define IS_TM_INT_CH1CC(x) (x == TM_INT_CH1CC)
#define IS_TM_INT_CH2CC(x) (x == TM_INT_CH2CC)
#define IS_TM_INT_CH3CC(x) (x == TM_INT_CH3CC)
#if (LIBCFG_PWM_8_CHANNEL)
#define IS_TM_INT_CH4CC(x) (x == TM_INT_CH4CC)
#define IS_TM_INT_CH5CC(x) (x == TM_INT_CH5CC)
#define IS_TM_INT_CH6CC(x) (x == TM_INT_CH6CC)
#define IS_TM_INT_CH7CC(x) (x == TM_INT_CH7CC)
#else
#define IS_TM_INT_CH4CC(x) (0)
#define IS_TM_INT_CH5CC(x) (0)
#define IS_TM_INT_CH6CC(x) (0)
#define IS_TM_INT_CH7CC(x) (0)
#endif
#define IS_TM_INT_UEV(x)   (x == TM_INT_UEV)
#define IS_TM_INT_UEV2(x)  (x == TM_INT_UEV2)
#define IS_TM_INT_TEV(x)   (x == TM_INT_TEV)
#define IS_TM_INT_BRKEV(x) (x == TM_INT_BRKEV)
#define IS_TM_GET_INT(x)   (IS_TM_INT_CH0CC(x) || \
                            IS_TM_INT_CH1CC(x) || \
                            IS_TM_INT_CH2CC(x) || \
                            IS_TM_INT_CH3CC(x) || \
                            IS_TM_INT_CH4CC(x) || \
                            IS_TM_INT_CH5CC(x) || \
                            IS_TM_INT_CH6CC(x) || \
                            IS_TM_INT_CH7CC(x) || \
                            IS_TM_INT_UEV(x)   || \
                            IS_TM_INT_UEV2(x)  || \
                            IS_TM_INT_TEV(x)   || \
                            IS_TM_INT_BRKEV(x))

/**
 * @brief Used to check parameter of the TM STI selection.
 */
#define IS_TM_TRSEL(x)     ((x == TM_TRSEL_UEVG)   || \
                            (x == TM_TRSEL_TI0S0)  || \
                            (x == TM_TRSEL_TI1S1)  || \
                            (x == TM_TRSEL_ETIF)   || \
                            (x == TM_TRSEL_TI0BED) || \
                            IS_TRSEL_ITI0(x)       || \
                            IS_TRSEL_ITI1(x)       || \
                            IS_TRSEL_ITI2(x))
/**
 * @brief Used to check parameter of the ITI.
 */
#if (LIBCFG_TM_NO_ITI == 1)
#else
#define IS_TM_ITI(x)  ((x == TM_TRSEL_ITI0) || (x == TM_TRSEL_ITI1) || (x == TM_TRSEL_ITI2))
#endif
/**
 * @brief Used to check parameter of the TM_TRSEL for \ref TM_ChExternalClockConfig function.
 */
#define IS_TM_TRSEL_CH(x)  ((x == TM_TRSEL_TI0S0) || (x == TM_TRSEL_TI1S1) || \
                              (x == TM_TRSEL_TI0BED))
/**
 * @brief Used to check parameter of the TM ETI polarity.
 */
#define IS_TM_ETIPOL(x) ((x == TM_ETIPOL_NONINVERTED) || (x == TM_ETIPOL_INVERTED))
/**
 * @brief Used to check parameter of the TM prescaler reload time.
 */
#define IS_TM_PSC_RLD(x) ((x == TM_PSC_RLD_UPDATE) || (x == TM_PSC_RLD_IMMEDIATE))
/**
 * @brief Used to check parameter of the forced action.
 */
#define IS_TM_OM_FORCED(x) ((x == TM_OM_FORCED_ACTIVE) || (x == TM_OM_FORCED_INACTIVE))
/**
 * @brief Used to check parameter of the decoder mode.
 */
#define IS_TM_SMSEL_DECODER(x)  ((x == TM_SMSEL_DECODER1) || (x == TM_SMSEL_DECODER2) || \
                                   (x == TM_SMSEL_DECODER3))
/**
 * @brief Used to check parameter of the event.
 */
#define IS_TM_EVENT(x)  (((x & 0xFFFFFAF0) == 0x0000) && (x != 0x0000))
/**
 * @brief Used to check parameter of the TM master mode selection.
 */
#define IS_TM_MMSEL_RESET(x)   (x == TM_MMSEL_RESET)
#define IS_TM_MMSEL_ENABLE(x)  (x == TM_MMSEL_ENABLE)
#define IS_TM_MMSEL_UPDATE(x)  (x == TM_MMSEL_UPDATE)
#define IS_TM_MMSEL_CH0CC(x)   (x == TM_MMSEL_CH0CC)
#define IS_TM_MMSEL_CH0OREF(x) (x == TM_MMSEL_CH0OREF)
#define IS_TM_MMSEL_CH1OREF(x) (x == TM_MMSEL_CH1OREF)
#define IS_TM_MMSEL_CH2OREF(x) (x == TM_MMSEL_CH2OREF)
#define IS_TM_MMSEL_CH3OREF(x) (x == TM_MMSEL_CH3OREF)
#if (LIBCFG_PWM_8_CHANNEL)
#define IS_TM_MMSEL_CH4OREF(x) (x == TM_MMSEL_CH4OREF)
#define IS_TM_MMSEL_CH5OREF(x) (x == TM_MMSEL_CH5OREF)
#define IS_TM_MMSEL_CH6OREF(x) (x == TM_MMSEL_CH6OREF)
#define IS_TM_MMSEL_CH7OREF(x) (x == TM_MMSEL_CH7OREF)
#else
#define IS_TM_MMSEL_CH4OREF(x) (0)
#define IS_TM_MMSEL_CH5OREF(x) (0)
#define IS_TM_MMSEL_CH6OREF(x) (0)
#define IS_TM_MMSEL_CH7OREF(x) (0)
#endif
#define IS_TM_MMSEL(x)  (IS_TM_MMSEL_RESET(x)   || \
                         IS_TM_MMSEL_ENABLE(x)  || \
                         IS_TM_MMSEL_UPDATE(x)  || \
                         IS_TM_MMSEL_CH0CC(x)   || \
                         IS_TM_MMSEL_CH0OREF(x) || \
                         IS_TM_MMSEL_CH1OREF(x) || \
                         IS_TM_MMSEL_CH2OREF(x) || \
                         IS_TM_MMSEL_CH3OREF(x) || \
                         IS_TM_MMSEL_CH4OREF(x) || \
                         IS_TM_MMSEL_CH5OREF(x) || \
                         IS_TM_MMSEL_CH6OREF(x) || \
                         IS_TM_MMSEL_CH7OREF(x))

/**
 * @brief Used to check parameter of the TM slave mode.
 */
#define IS_TM_SLAVE_MODE(x) ((x == TM_SMSEL_RESTART) || (x == TM_SMSEL_PAUSE) || \
                               (x == TM_SMSEL_TRIGGER) || (x == TM_SMSEL_STIED))
/**
 * @brief Used to check parameter of the TM flag.
 */
#define IS_TM_FLAG_CH0CC(x) (x == TM_FLAG_CH0CC)
#define IS_TM_FLAG_CH1CC(x) (x == TM_FLAG_CH1CC)
#define IS_TM_FLAG_CH2CC(x) (x == TM_FLAG_CH2CC)
#define IS_TM_FLAG_CH3CC(x) (x == TM_FLAG_CH3CC)
#if (LIBCFG_PWM_8_CHANNEL)
#define IS_TM_FLAG_CH4CC(x) (x == TM_FLAG_CH4CC)
#define IS_TM_FLAG_CH5CC(x) (x == TM_FLAG_CH5CC)
#define IS_TM_FLAG_CH6CC(x) (x == TM_FLAG_CH6CC)
#define IS_TM_FLAG_CH7CC(x) (x == TM_FLAG_CH7CC)
#else
#define IS_TM_FLAG_CH4CC(x) (0)
#define IS_TM_FLAG_CH5CC(x) (0)
#define IS_TM_FLAG_CH6CC(x) (0)
#define IS_TM_FLAG_CH7CC(x) (0)
#endif
#define IS_TM_FLAG_CH0OC(x) (x == TM_FLAG_CH0OC)
#define IS_TM_FLAG_CH1OC(x) (x == TM_FLAG_CH1OC)
#define IS_TM_FLAG_CH2OC(x) (x == TM_FLAG_CH2OC)
#define IS_TM_FLAG_CH3OC(x) (x == TM_FLAG_CH3OC)
#define IS_TM_FLAG_UEV(x)   (x == TM_FLAG_UEV)
#define IS_TM_FLAG_UEV2(x)  (x == TM_FLAG_UEV2)
#define IS_TM_FLAG_TEV(x)   (x == TM_FLAG_TEV)
#define IS_TM_FLAG_BRK0(x)  (x == TM_FLAG_BRK0)
#define IS_TM_FLAG_BRK1(x)  (x == TM_FLAG_BRK1)
#define IS_TM_FLAG(x) (IS_TM_FLAG_CH0CC(x) || \
                       IS_TM_FLAG_CH1CC(x) || \
                       IS_TM_FLAG_CH2CC(x) || \
                       IS_TM_FLAG_CH3CC(x) || \
                       IS_TM_FLAG_CH4CC(x) || \
                       IS_TM_FLAG_CH5CC(x) || \
                       IS_TM_FLAG_CH6CC(x) || \
                       IS_TM_FLAG_CH7CC(x) || \
                       IS_TM_FLAG_CH0OC(x) || \
                       IS_TM_FLAG_CH1OC(x) || \
                       IS_TM_FLAG_CH2OC(x) || \
                       IS_TM_FLAG_CH3OC(x) || \
                       IS_TM_FLAG_UEV(x)   || \
                       IS_TM_FLAG_UEV2(x)  || \
                       IS_TM_FLAG_TEV(x)   || \
                       IS_TM_FLAG_BRK0(x)  || \
                       IS_TM_FLAG_BRK1(x))

/**
 * @brief Used to check parameter of the TM flag for \ref TM_ClearFlag function.
 */
#define IS_TM_FLAG_CLR(x) (((x & 0xFFFFFA00) == 0) && (x != 0))
/**
 * @brief Used to check value of TM digital filter.
 */
#if (LIBCFG_TM_65X_66X_V1)
#define IS_TM_FILTER(x) (x <= 0xFF)
#else
#define IS_TM_FILTER(x) (x <= 0xF)
#endif

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------------------------------------*/
/** @defgroup TM_Exported_Functions TM exported functions
  * @{
  */
#define TM_SetCaptureCompare0(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_0, Cmp)
#define TM_SetCaptureCompare1(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_1, Cmp)
#define TM_SetCaptureCompare2(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_2, Cmp)
#define TM_SetCaptureCompare3(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_3, Cmp)
#if (LIBCFG_PWM_8_CHANNEL)
#define TM_SetCaptureCompare4(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_4, Cmp)
#define TM_SetCaptureCompare5(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_5, Cmp)
#define TM_SetCaptureCompare6(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_6, Cmp)
#define TM_SetCaptureCompare7(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_7, Cmp)
#endif

