RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/inc/ht32f5xxxx_tm.h
#define TM_ForcedOREF0(TMx, ForcedAction)     TM_ForcedOREF(TMx, TM_CH_0, ForcedAction)
#define TM_ForcedOREF1(TMx, ForcedAction)     TM_ForcedOREF(TMx, TM_CH_1, ForcedAction)
#define TM_ForcedOREF2(TMx, ForcedAction)     TM_ForcedOREF(TMx, TM_CH_2, ForcedAction)
#define TM_ForcedOREF3(TMx, ForcedAction)     TM_ForcedOREF(TMx, TM_CH_3, ForcedAction)
#if (LIBCFG_PWM_8_CHANNEL)
#define TM_ForcedOREF4(TMx, ForcedAction)     TM_ForcedOREF(TMx, TM_CH_4, ForcedAction)
#define TM_ForcedOREF5(TMx, ForcedAction)     TM_ForcedOREF(TMx, TM_CH_5, ForcedAction)
#define TM_ForcedOREF6(TMx, ForcedAction)     TM_ForcedOREF(TMx, TM_CH_6, ForcedAction)
#define TM_ForcedOREF7(TMx, ForcedAction)     TM_ForcedOREF(TMx, TM_CH_7, ForcedAction)
#endif

#define TM_SetAsymmetricCompare0(TMx, Cmp)    TM_SetAsymmetricCompare(TMx, TM_CH_0, Cmp)
#define TM_SetAsymmetricCompare1(TMx, Cmp)    TM_SetAsymmetricCompare(TMx, TM_CH_1, Cmp)
#define TM_SetAsymmetricCompare2(TMx, Cmp)    TM_SetAsymmetricCompare(TMx, TM_CH_2, Cmp)
#define TM_SetAsymmetricCompare3(TMx, Cmp)    TM_SetAsymmetricCompare(TMx, TM_CH_3, Cmp)

#define TM_GetCaptureCompare0(TMx)            TM_GetCaptureCompare(TMx, TM_CH_0)
#define TM_GetCaptureCompare1(TMx)            TM_GetCaptureCompare(TMx, TM_CH_1)
#define TM_GetCaptureCompare2(TMx)            TM_GetCaptureCompare(TMx, TM_CH_2)
#define TM_GetCaptureCompare3(TMx)            TM_GetCaptureCompare(TMx, TM_CH_3)
#if (LIBCFG_PWM_8_CHANNEL)
#define TM_GetCaptureCompare4(TMx)            TM_GetCaptureCompare(TMx, TM_CH_4)
#define TM_GetCaptureCompare5(TMx)            TM_GetCaptureCompare(TMx, TM_CH_5)
#define TM_GetCaptureCompare6(TMx)            TM_GetCaptureCompare(TMx, TM_CH_6)
#define TM_GetCaptureCompare7(TMx)            TM_GetCaptureCompare(TMx, TM_CH_7)
#endif

void TM_DeInit(HT_TM_TypeDef* TMx);
void TM_TimeBaseInit(HT_TM_TypeDef* TMx, TM_TimeBaseInitTypeDef* TimeBaseInit);
void TM_OutputInit(HT_TM_TypeDef* TMx, TM_OutputInitTypeDef* OutInit);
void TM_CaptureInit(HT_TM_TypeDef* TMx, TM_CaptureInitTypeDef* CapInit);
void TM_PwmInputInit(HT_TM_TypeDef* TMx, TM_CaptureInitTypeDef* CapInit);
void TM_TimeBaseStructInit(TM_TimeBaseInitTypeDef* TimeBaseInit);
void TM_OutputStructInit(TM_OutputInitTypeDef* OutInit);
void TM_CaptureStructInit(TM_CaptureInitTypeDef* CapInit);
void TM_Cmd(HT_TM_TypeDef* TMx, ControlStatus NewState);
#if (LIBCFG_TM_NO_ITI == 1)
#else
void TM_ItiExternalClockConfig(HT_TM_TypeDef* TMx, TM_TRSEL_Enum Iti);
#endif
void TM_ChExternalClockConfig(HT_TM_TypeDef* TMx, TM_TRSEL_Enum Sel, TM_CHP_Enum Pol, u8 Filter);
#if 0 // M0+ not supported
void TM_EtiExternalClockConfig(HT_TM_TypeDef* TMx, TM_ETIPSC_Enum Psc, TM_ETIPOL_Enum Pol, u8 Filter);
void TM_EtiConfig(HT_TM_TypeDef* TMx, TM_ETIPSC_Enum Psc, TM_ETIPOL_Enum Pol, u8 Filter);
#endif
void TM_PrescalerConfig(HT_TM_TypeDef* TMx, u16 Psc, TM_PSC_RLD_Enum PscReloadTime);
void TM_CounterModeConfig(HT_TM_TypeDef* TMx, TM_CNT_MODE_Enum Mod);
void TM_StiConfig(HT_TM_TypeDef* TMx, TM_TRSEL_Enum Sel);
void TM_DecoderConfig(HT_TM_TypeDef* TMx, TM_SMSEL_Enum DecoderMod, TM_CHP_Enum CH0P, TM_CHP_Enum CH1P);

void TM_ForcedOREF(HT_TM_TypeDef* TMx, TM_CH_Enum TM_CH_n, TM_OM_Enum ForcedAction);
void TM_CRRPreloadCmd(HT_TM_TypeDef* TMx, ControlStatus NewState);
void TM_CHCCRPreloadConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, ControlStatus NewState);
#if 0 // M0+ not supported
void TM_ClearOREFConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, ControlStatus NewState);
#endif
void TM_ChPolarityConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, TM_CHP_Enum Pol);

void TM_ImmActiveConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, ControlStatus NewState);
void TM_ChannelConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, TM_CHCTL_Enum Control);

void TM_OutputModeConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, TM_OM_Enum Mod);
void TM_UpdateCmd(HT_TM_TypeDef* TMx, ControlStatus NewState);
void TM_UEVG_IntConfig(HT_TM_TypeDef* TMx, ControlStatus NewState);
void TM_HallInterfaceCmd(HT_TM_TypeDef* TMx, ControlStatus NewState);
void TM_SinglePulseModeCmd(HT_TM_TypeDef* TMx, ControlStatus NewState);
void TM_MMSELConfig(HT_TM_TypeDef* TMx, TM_MMSEL_Enum Sel);
void TM_SlaveModeConfig(HT_TM_TypeDef* TMx, TM_SMSEL_Enum Sel);
void TM_TimSyncCmd(HT_TM_TypeDef* TMx, ControlStatus NewState);
void TM_SetCounter(HT_TM_TypeDef* TMx, u16 Counter);
void TM_SetCounterReload(HT_TM_TypeDef* TMx, u16 Reload);
void TM_SetCaptureCompare(HT_TM_TypeDef* TMx, TM_CH_Enum TM_CH_n, u16 Cmp);
void TM_SetAsymmetricCompare(HT_TM_TypeDef* TMx, TM_CH_Enum TM_CH_n, u16 Cmp);

void TM_CHPSCConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, TM_CHPSC_Enum Psc);
void TM_CKDIVConfig(HT_TM_TypeDef* TMx, TM_CKDIV_Enum Div);
u32 TM_GetCaptureCompare(HT_TM_TypeDef* TMx, TM_CH_Enum TM_CH_n);
u32 TM_GetCounter(HT_TM_TypeDef* TMx);
u32 TM_GetPrescaler(HT_TM_TypeDef* TMx);
void TM_GenerateEvent(HT_TM_TypeDef* TMx, u32 TM_EVENT);
FlagStatus TM_GetFlagStatus(HT_TM_TypeDef* TMx, u32 TM_FLAG);
void TM_ClearFlag(HT_TM_TypeDef* TMx, u32 TM_FLAG);
void TM_IntConfig(HT_TM_TypeDef* TMx, u32 TM_INT, ControlStatus NewState);
FlagStatus TM_GetIntStatus(HT_TM_TypeDef* TMx, u32 TM_INT);
void TM_ClearIntPendingBit(HT_TM_TypeDef* TMx, u32 TM_INT);
void TM_InternalClockConfig(HT_TM_TypeDef* TMx);

#if (LIBCFG_PDMA)
void TM_CHCCDSConfig(HT_TM_TypeDef* TMx, TM_CHCCDS_Enum Selection);
void TM_PDMAConfig(HT_TM_TypeDef* TMx, u32 TM_PDMA, ControlStatus NewState);
#endif
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif
